function createChart(canvasId, data) {
    const ctx = document.getElementById(canvasId).getContext("2d");
    return new Chart(ctx, {
      type: "bar",
      data: data,
      options: {
        responsive: true,
        scales: {
          y: {
            beginAtZero: true,
            title: {
              display: true,
              text: "Длительность (дни)",
            },
          },
        },
      },
    });
  }
  
  // Определите данные для графика
  const chartData = {
    labels: [
      "Подготовка производства",
      "Закупки",
      "Изготовительный период",
      "Блочный период",
      "Стапельный период",
      "Достройка на стапеле",
    ],
    datasets: [
      {
        label: "Длительность (дни)",
        data: [290, 305, 105, 80, 62, 222],
        backgroundColor: [
          "rgba(255, 99, 132, 0.6)",
          "rgba(54, 162, 235, 0.6)",
          "rgba(255, 206, 86, 0.6)",
          "rgba(75, 192, 192, 0.6)",
          "rgba(153, 102, 255, 0.6)",
          "rgba(255, 159, 64, 0.6)",
        ],
        borderColor: [
          "rgba(255, 99, 132, 1)",
          "rgba(54, 162, 235, 1)",
          "rgba(255, 206, 86, 1)",
          "rgba(75, 192, 192, 1)",
          "rgba(153, 102, 255, 1)",
          "rgba(255, 159, 64, 1)",
        ],
        borderWidth: 1,
      },
    ],
  };
  
  // Создайте график и свяжите его с вкладкой
  const chart1 = createChart("graphCanvas1", chartData);
  const chartData2 = {
    labels: [
      "Монтаж системы",
      "Монтаж оборудования",
      "Насыщение и сдача под изоляцию",
      "Изоляция помещений",
      "Достроечные работы",
      "Затяжка кабеля и электромонтажные работы",
      "Установка оборешетника и зашивка помещений",
      "Оборудование помещений",
      "Нанесение покрытий в помещениях",
    ],
    datasets: [
      {
        label: "Длительность (дни)",
        data: [100, 110, 55, 60, 60, 65, 55, 50, 40],
        backgroundColor: [
          "rgba(255, 99, 132, 0.6)",
          "rgba(54, 162, 235, 0.6)",
          "rgba(255, 206, 86, 0.6)",
          "rgba(75, 192, 192, 0.6)",
          "rgba(153, 102, 255, 0.6)",
          "rgba(255, 159, 64, 0.6)",
          "rgba(128, 128, 128, 0.6)",
          "rgba(0, 128, 0, 0.6)",
          "rgba(255, 0, 0, 0.6)",
        ],
        borderColor: [
          "rgba(255, 99, 132, 1)",
          "rgba(54, 162, 235, 1)",
          "rgba(255, 206, 86, 1)",
          "rgba(75, 192, 192, 1)",
          "rgba(153, 102, 255, 1)",
          "rgba(255, 159, 64, 1)",
          "rgba(128, 128, 128, 1)",
          "rgba(0, 128, 0, 1)",
          "rgba(255, 0, 0, 1)",
        ],
        borderWidth: 1,
      },
    ],
  };
  
  // Создайте график и свяжите его с второй вкладкой
  const chart2 = createChart("graphCanvas2", chartData2);
  // Вычислите суммарное количество дней
